<!DOCTYPE html>
<html lang="en" dir="ltr">
  <head>
    <meta charset="utf-8">
    <title>Vellum | Backend Books</title>
    <link rel="stylesheet" href="style.css">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <script src="https://www.gstatic.com/firebasejs/7.17.2/firebase.js"></script>
<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.5.1/jquery.min.js"></script>
    <script src="splitting.min.js"></script>

<!-- Favicon -->


  </head>
  <body>


<div class="textContainer">

<div id="side" class="side2">
  <img class="image" id="photo" src="vellumramme.jpg" alt="">
<p class="tittel"> Vellum</p>
<p id="byline"> Truls Bauer</p>
</div>


  <div id="main" class="main2">



    <p id="text" class="small">
    Jeg heter Vellum. Jeg er tretten &aring;r og har tidlig alzheimers. Bor i Troms&oslash;. Mitt navn er tretten &aring;r
gamle Vellum og jeg har f&aring;tt for tidlig alzheimers for jeg jobbet som barnetester av
voksenmedisin for Universitetet i Troms&oslash;. Jeg heter Vellum og jeg r&oslash;yker ikke og jeg sigger
ikke. I 2019 n&aring;r jeg var tolv &aring;r gammel fikk jeg min f&oslash;rste jobb ved forskningsinstituttet p&aring;
Universitetet i Troms&oslash;. Der skulle jeg som barn teste voksnes medisiner for &aring; se om det kunne
v&aelig;re skadelig for barn &aring; f&aring; medisiner som egentlig skal v&aelig;re for voksne. Da fikk jeg alzheimer
n&aring;r jeg testet en type medisin da jeg var tretten &aring;r. Alzheimers er en hjernesykdom som gj&oslash;r at
man blir glemsk, vanlig for voksne og ikke vanlig i barn. Men jeg hadde testet medisin og f&aring;tt det
som tretten.<br><br>
Det skjedde n&aring;r legen ga litt penger til meg og sa jeg kunne pr&oslash;ve litt medisin for
voksen. Selv om det var barn, het Vellum. N&aring;r de fortalte til meg etterp&aring; at jeg dessverre hadde
blitt p&aring;vist med tidlig Alzheimer, en hjernesykdom som var vanlig for voksne og ikke for tretten
&aring;r gutt mistet forstanden av meg. G&aring;tt helt glipp!<br><br>
Dagen var min nabotante Milles femti&aring;rsdag, men jeg var p&aring; Universitetet i Troms&oslash; sin
forskningslab. Alt jeg ville der var &aring; sp&oslash;rre legen hva som var vanlig kropptykke for en tretten &aring;r
gutt. Nei, nei. Dagene, de dras fra meg. Jeg husker det kalde regnet p&aring; skjorteryggen en
mainatt n&aring;r Sophia Manthey skrev sine brev til meg. P&aring; bordkortet mitt hadde Sunniva Mono
tegnet et lite hjerte med en pil gjennom. Hun hadde hjulpet mor med forberedelsene og den
myke omtanken hun viste gjorde noe med meg.<br><br>
Jeg er kun tretten &aring;r og mitt navn er Vellum, men det Sonja gjorde tok frem dyret i meg.
Jeg ble vill i min pupill - ville ha hun som var s&aring; snill! Mot min mor, min mor, mim matede mor.
Tretten &aring;r gutt ble sugen p&aring; Sopranos Mambo, men hun var reist. I alle sine dager hadde
hullene i tennene mine grodd til store plugger. Tenner i tennene mine. Jeg glemmer r&oslash;ykpakken
p&aring; rema 1000. Hadde store planer: skulle lage dokumentar om USA. Nei, Vellums trettne
gutte&aring;r: full av sykdommen Alzheimer. En sykdom for voksne, feilplassert i unge gutten Vellum.
Nabotante Mille hadde laget sin melonpostei med sm&aring; biter, men var et annet sted. Jeg var
Vellum, tretten &aring;r med Alzheimers. <br>
Dagene drar fra meg.
</p>

</div>
</div>


    <!-- <script src="script.js"></script> -->
<script type="text/javascript">

let mobileDevice = false;


  if( /Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent) ) {
   // some code..
   mobileDevice = true;
  }


window.addEventListener('wheel',function(e){
  changeImg();
})

window.addEventListener('touchmove',function(e){
  changeImg();
})

function changeImg(){

  a = window.pageYOffset
  // console.log(window.pageYOffset)

  if(mobileDevice){
    b = window.innerHeight/4;
  }else{
    b = document.body.scrollHeight - window.innerHeight
  }

  let c = a / b;

  if(c > 0.25 && c < 0.5){
    photo.src = "vellumramme2.jpg"
  }else if(c > 0.5 && c < 0.75){
    photo.src = "vellumramme3.jpg"
  }else if(c > 0.75){
    photo.src = "vellumramme4.jpg"
  }else if(c < 0.25){
    photo.src = "vellumramme.jpg"
  }
}

</script>

  </body>
</html>
